# Приведем список покупок в магазине

shop_list = ['Картофель', 'Горошек', 'Рис', 'Хлеб']

# Измените список согласно пунктам задания
# Выведите результат каждого пункта на консоль по очереди
#   а. Вставьте рыбу между горошком и рисом
#   b. Добавьте фрукты из списка fruits в конец спика shop_list

fruits = ['Яблоко', 'Апельсин', 'Клубника']

#   c. Удалите из списка shop_list Картофель
#   d. Какими по счету стоят хлеб и Апельсин? Выведети номера на консоль в формате
#   Номер в "продукта" в списке - N 
