# Приведем плейлист песен в виде списка списков
# Список my_favorite_songs содержит список названий и длительности каждого трека

my_favorite_songs = [
    ['Waste a Moment', 3.03],
    ['New Salvation', 4.02],
    ['Staying\' Alive', 3.40],
    ['Out of Touch', 3.03],
    ['A Sorta Fairytale', 5.28]
]

# Выведите общее время звучания любых трех песен в формате
# Три песни звучат ХХХ минут
# Сделайте необходимые вычисления заранее, а затем выводите print(xxx, yyy, zzz)
